tutoriel-git.org
#+INCLUDE: "headers.org"
#+TITLE: Tutoriel Git et GitHub

#+begin_src org :exports (when (eq org-export-current-backend 'xelatex) "none")
Tout d’abord, si tu veux la version PDF du bouzin, [[https://phundrak.fr/git/tutoriel-git.pdf][c’est par là]].

Et pour le code source de cette page, c’est [[https://github.com/Phundrak/tutoriel-git][là]], sur GitHub.
#+end_src
* Git ? Qu’est-ce donc ?
Git est un logiciel de version de fichiers permettant de garder une trace de toutes les modifications apportées au fichiers suivis dans un répertoire (un dépôt) et ses sous-répertoires –sous couvert qu’ils n’aient pas été ignorés explicitement. Il permet également de conserver plusieurs versions parallèles du projet, comme par exemple une version stable et une version de développement, et permet l’ajout de modifications d’une de ces versions parallèles à une autre via des fusions partielles ou totales de branches, avec une automatisation des fusions de fichiers lorsqu’il n’y a pas de conflit entre ces derniers.

Avant de continuer, sache que je suis bilingue français-sarcasme, si tu es du genre à t’énerver pour un rien, cette page est à haut risque pour toi.

Toujours là ? Tu auras été prévenu·e.
* Ça a l’air cool, comment ça s’obtient ?
** Et surtout, comment ça s’installe ?
Très bonne question Kévin. Tout d’abord, il faut t’assurer que git soit installé sur ton système et utilisable depuis le terminal. Sous GNU/Linux, tu peux l’installer via ton gestionnaire de paquet, ce qui rendra la commande accessible directement depuis le terminal.
#+BEGIN_SRC text
  $ apt install git                    # Debian, Ubuntu et les distros basées dessus
  $ yum install git                    # CentOS
  $ dnf -y install git                 # Fedora
  $ pacman -S git                      # ArchLinux et les distros basées dessus
  $ emerge --ask --verbose dec-vcs/git # >install Gentoo
#+END_SRC
Si tu n’es pas sous GNU/Linux mais que tu as au moins le goût d’être sous un OS de type Unix, tu peux exécuter la commande correspondante à ton OS suivant :
#+BEGIN_SRC text
  $ pkg install git                                     # FreeBSD
  $ brew install git                                    # macOS avec brew
  $ port install git +svn +doc +bash_completion +gitweb # macOS avec MacPorts
#+END_SRC
Si tu es sous Windows... Bonne chance. Toutes les commandes seront en syntaxe Unix dans ce tutoriel, mais si tu as bien deux neurones, tu devrais pouvoir tout de même suivre le tutoriel.
** Ok c’est bon, et il y a une configuration à faire ?
Tu peux configurer Git si tu le souhaites, oui. En général, il est recommandé de paramétrer au moins son nom et son email. Tu peux les paramétrer via la ligne de commande :
#+BEGIN_SRC text
  $ git config --global user.name "Ton Nom"
  $ git config --global user.email "ton@email.truc"
#+END_SRC
Tu peux aussi éditer le fichier =~/.gitconfig= comme suit :
#+BEGIN_SRC text
  [user]
       email = ton@email.truc
       name = Ton nom
#+END_SRC
Cela permettra d’associer ton nom et ton adresse mail à tes commits. Par défaut, ceux qui sont enregistrés avec ton compte utilisateur de ton PC sont mis par défaut dans ces paramètres, mais on met quasiment tous un nom à la con quand on le créé. Et ça permet d’avoir les même paramètres si tu es sur un autre ordinateur.

Il y a encore pas mal de paramètres que tu peux gérer avec ce fichier, je reparlerai de certains plus tard, mais pour le reste, la documentation en ligne sur =gitconfig= ne manque pas.
* Ok très bien, comment on l’utilise maintenant ?
Du calme Jean-Kévin, ralentis un peu. Comme le dit ce vieux dicton Chinois :
#+BEGIN_QUOTE
Celui qui marche trop vite…… marche…………… trop… vite…? Tu peux tomber et te faire mal je suppose.
#+END_QUOTE
Bon, c’est une contrefaçon, donc la qualité de la citation n’est pas extraordinaire. Bref.
** Je commence comment ?
Si tu souhaites créer un dépôt git, rien de plus simple : créé ton répertoire dans lequel tu travailleras, et déplace-y-toi. Ensuite, tu pourra initialiser ton dépôt via la commande =git init=.
#+BEGIN_SRC text
  $ mkdir monsuperprojet
  $ cd monsuperprojet
  $ git init
  Initialized empty Git repository in /tmp/monsuperprojet/.git/
#+END_SRC
Si tu obtiens à peu près le même message après la dernière commande, félicitations ! Tu viens de créer ton premier dépôt git. En l’occurrence, j’ai créé mon dépôt dans =/tmp=, mais toi tu peux voir un truc du genre =/home/corentin/monsuperprojet= à la place. Tu peux vérifier que tout va bien en rentrant la commande =git status=
#+BEGIN_SRC text
  $ git status
  On branch master

  No commits yet

  nothing to commit (create/copy files and use "git add" to track)
#+END_SRC
Parfait !
