tutoriel-git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2018-10-05 ven. 13:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tutoriel Git et GitHub</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lucien Cartier-Tilet" />
<link rel="stylesheet" type="text/css" href="https://langue.phundrak.fr/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://langue.phundrak.fr/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tutoriel Git et GitHub</h1>
<p>

</p>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org424efeb">1. Git ? Qu’est-ce donc ?</a></li>
<li><a href="#org04d5b23">2. Ça a l’air cool, comment ça s’utilise ?</a>
<ul>
<li><a href="#org46a0365">2.1. Et surtout, comment ça s’installe ?</a></li>
<li><a href="#orgd3f885f">2.2. Ok c’est bon, et il y a une configuration à faire ?</a></li>
</ul>
</li>
<li><a href="#org3b01d46">3. Ok très bien, mais je veux utiliser git moi !</a>
<ul>
<li><a href="#orga446891">3.1. Je commmence comment ?</a></li>
<li><a href="#orgaf9966d">3.2. Et pour ajouter des fichiers ?</a></li>
<li><a href="#org4d067d2">3.3. Cool, mais j’ai accidentellement mis un fichier en staging</a></li>
<li><a href="#orga03d27e">3.4. En fait, j’ai juste oublié un truc dans mon commit précédent</a></li>
</ul>
</li>
<li><a href="#org5c917f7">4. Euh, j’ai oublié ce que j’ai changé lors du dernier commit</a></li>
<li><a href="#org35ba9ee">5. Il y a des fichiers dont je me fiche dans mon dépot</a></li>
<li><a href="#orgccda07e">6. J’ai entendu parler de GitHub…</a>
<ul>
<li><a href="#orgde64bff">6.1. J’ai téléchargé un projet en zip</a></li>
<li><a href="#org1e85cba">6.2. Et si je veux créer mon propre dépôt sur GitHub</a></li>
<li><a href="#org7eaca37">6.3. Et du coup, comment je met tout ça en ligne ?</a></li>
<li><a href="#org9c233f0">6.4. Quelqu’un a fait des modifications depuis mon dernier commit, je récupère ça comment ?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>

</p>
<div class="org-src-container">
<pre class="src src-org">Et tout d&#8217;abord, si tu veux la version PDF du bouzin, <span style="color: #975D4A; text-decoration: underline;"><a href="https://phundrak.fr/git/tutoriel-git.pdf">c&#8217;est par l&#224;</a></span>.

Et pour le code source de cette page, c&#8217;est <span style="color: #975D4A; text-decoration: underline;"><a href="https://phundrak.fr/git/tutoriel-git.org">l&#224;</a></span>, <span style="color: #975D4A; text-decoration: underline;"><a href="https://phundrak.fr/git/theme-readtheorg.setup">l&#224;</a></span> et <span style="color: #975D4A; text-decoration: underline;"><a href="https://phundrak.fr/git/headers.org">l&#224;</a></span>.
</pre>
</div>
<div id="outline-container-org424efeb" class="outline-2">
<h2 id="org424efeb"><span class="section-number-2">1</span> Git ? Qu’est-ce donc ?</h2>
<div class="outline-text-2" id="text-1">
<p>
Git est un logiciel de version de fichiers permettant de garder une trace de toutes les modifications apportées au fichiers suivis dans un répertoire (un dépôt) et ses sous-répertoires –sous couvert qu’ils n’aient pas été ignorés explicitement. Il permet également de conserver plusieurs versions parallèles du projet, comme par exemple une version stable et une version de développement, et permet l’ajout de modifications d’une de ces versions parallèles à une autre via des fusions partielles ou totales de branches, avec une automatisation des fusions de fichiers lorsqu’il n’y a pas de conflit entre ces derniers.
</p>
</div>
</div>
<div id="outline-container-org04d5b23" class="outline-2">
<h2 id="org04d5b23"><span class="section-number-2">2</span> Ça a l’air cool, comment ça s’utilise ?</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org46a0365" class="outline-3">
<h3 id="org46a0365"><span class="section-number-3">2.1</span> Et surtout, comment ça s’installe ?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Très bonne question Kevin. Tout d’abord, il faut t’assurer que git soit installé sur ton système et utilisable depuis le terminal. Sous GNU/Linux, tu peux l’installer via ton gestionnaire de paquet, ce qui rendra la commande accessible directement depuis le terminal.
</p>
<div class="org-src-container">
<pre class="src src-text">$ apt install git                    # Debian, Ubuntu et les distros bas&#233;es dessus
$ yum install git                    # CentOS
$ dnf -y install git                 # Fedora
$ pacman -S git                      # ArchLinux et les distros bas&#233;es dessus
$ emerge --ask --verbose dec-vcs/git # &gt;install Gentoo
</pre>
</div>
<p>
Si tu n’es pas sous GNU/Linux mais que tu as au moins le goût d’être sous un OS de type Unix, tu peux exécuter la commande correspondante à ton OS suivant :
</p>
<div class="org-src-container">
<pre class="src src-text">$ pkg install git                                     # FreeBSD
$ brew install git                                    # macOS avec brew
$ port install git +svn +doc +bash_completion +gitweb # macOS avec MacPorts
</pre>
</div>
<p>
Si tu es sous Windows&#x2026; Bonne chance. Toutes les commandes seront en syntaxe Unix dans ce tutoriel, mais si tu as bien deux neurones, tu devrais pouvoir tout de même suivre le tutoriel.
</p>
</div>
</div>
<div id="outline-container-orgd3f885f" class="outline-3">
<h3 id="orgd3f885f"><span class="section-number-3">2.2</span> Ok c’est bon, et il y a une configuration à faire ?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Tu peux configurer Git si tu le souhaites, oui. En général, il est recommandé de paramétrer au moins son nom et son email. Tu peux les paramétrer via la ligne de commande :
</p>
<div class="org-src-container">
<pre class="src src-text">$ git config --global user.name "Ton Nom"
$ git config --global user.email "ton@email.truc"
</pre>
</div>
<p>
Tu peux aussi éditer le fichier <code>~/.gitconfig</code> comme suit :
</p>
<div class="org-src-container">
<pre class="src src-text">[user]
     email = ton@email.truc
     name = Ton nom
</pre>
</div>
<p>
Cela permettra d’associer ton nom et ton adresse mail à tes commits. Par défaut, ceux qui sont enregistrés avec ton compte utilisateur de ton PC sont mis par défaut dans ces paramètres, mais on met quasiment tous un nom à la con quand on le créé. Et ça permet d’avoir les même paramètres si tu es sur un autre ordinateur.
</p>

<p>
Il y a encore pas mal de paramètres que tu peux gérer avec ce fichier, je reparlerai de certains plus tard, mais pour le reste, la documentation en ligne sur <code>gitconfig</code> ne manque pas.
</p>
</div>
</div>
</div>
<div id="outline-container-org3b01d46" class="outline-2">
<h2 id="org3b01d46"><span class="section-number-2">3</span> Ok très bien, mais je veux utiliser git moi !</h2>
<div class="outline-text-2" id="text-3">
<p>
Du calme Jean-Kévin, ralentis un peu. Comme le dit ce vieux dicton Chinois :
</p>
<blockquote>
<p>
Celui qui marche trop vite…… marche…………… trop… vite…? Tu peux tomber et te faire mal je suppose.
</p>
</blockquote>
<p>
Bon, c’est une contrefaçon, donc la qualité de la citation n’est pas extraordinaire. Bref.
</p>
</div>
<div id="outline-container-orga446891" class="outline-3">
<h3 id="orga446891"><span class="section-number-3">3.1</span> Je commmence comment ?</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Si tu souhaites créer un dépôt git, rien de plus simple : créé ton répertoire dans lequel tu travailleras, et déplace-y-toi. Ensuite, tu pourra initialiser ton dépôt via la commande <code>git init</code>.
</p>
<div class="org-src-container">
<pre class="src src-text">$ mkdir monsuperprojet
$ cd monsuperprojet
$ git init
Initialized empty Git repository in /tmp/monsuperprojet/.git/
</pre>
</div>
<p>
Si tu obtiens à peu près le même message après la dernière commande, félicitations ! Tu viens de créer ton premier dépôt git. En l’occurence, j’ai créé mon dépôt dans <code>/tmp</code>, mais toi tu peux voir un truc du genre <code>/home/corentin/monsuperprojet</code> à la place. Tu peux vérifier que tout va bien en rentrant la commande <code>git status</code>
</p>
<div class="org-src-container">
<pre class="src src-text">$ git status
On branch master

No commits yet

nothing to commit (create/copy files and use "git add" to track)
</pre>
</div>
<p>
Parfait !
</p>
</div>
</div>
