tutoriel-git.org
** Et pour ajouter des fichiers ?
Maintenant tu peux commencer à travailler sur ton projet. Mais tout d’abord, on va voir ce qu’il se passe si jamais on créé un fichier dans le dépôt. Créé un fichier =main.c= dans lequel tu vas entrer ce code :
#+BEGIN_SRC C
  #include <stdio.h>
  int main(int argc, char *argv[]) {
    printf("Hello World!\n");
    return 0;
  }
#+END_SRC
En exécutant à nouveau =git status=, on peut voir la sortie suivante :
#+BEGIN_SRC text
  $ git status
  On branch master

  No commits yet

  Untracked files:
    (use "git add <file>..." to include in what will be committed)

          main.c

  nothing added to commit but untracked files present (use "git add" to track)
#+END_SRC
Tu commences à comprendre un peu le bail ? Git vient de détecter qu’un nouveau fichier a été créé qu’il ne connaissait pas avant. Suivons ses bon conseils et ajoutons le fichier au dépôt.
#+BEGIN_SRC text
  $ git add main.c
  $ git status
  On branch master

  No commits yet

  Changes to be committed:
    (use "git rm --cached <file>..." to unstage)

          new file:   main.c
#+END_SRC
Super, maintenant git va surveiller les changements du fichier, mais attention, il n’a pas encore enregistré son état. Pour l’instant il sait juste que le fichier est là, dans un certain état, mais rien ne garanti encore qu’on pourra retrouver cet état plus tard. On appelle ça le /staging/. Pour ce faire, il faut créer ce qu’on appelle un commit. En gros, il s’agit d’un enregistrement des modifications apportées à un ou plusieurs fichiers (dans leur globalité ou partiellement, on verra ça plus tard), le tout avec un commentaire.
#+BEGIN_SRC text
  $ git commit -m "Un petit pas pour moi, un grand pas pour mon projet"
  [master (root-commit) 89139ef] Un petit pas pour moi, un grand pas pour mon projet
   1 file changed, 6 insertions(+)
   create mode 100644 main.c
#+END_SRC
Parfait ! Certains éléments peuvent être un peu différent chez toi, comme par exemple la référence du commit juste avant le message. Ça, c’est un truc qui est géré automatiquement par git. Et voilà, on a l’état de notre répertoire qui est enregistré et qui sera disponible plus tard. Maintenant, tu sais comment enregistrer des état de ton dépôt via les commits.
** Cool, mais j’ai accidentellement mis un fichier en staging
Si jamais tu as un staging que tu veux annuler, tu peux utiliser la commande =git reset HEAD nomdetonfichier voiredautresfichiers= pour annuler le staging. Une fois le fichier qui n’est plus dans ton staging, tu peux même annuler toutes les modifications que tu as apporté au fichier depuis ton dernier commit avec la commande =git checkout -- tonfichier voiredautresfichiers=. Par exemple, si j’ai modifié mon =main.c= en modifiant ainsi les arguments du =main()= :
#+BEGIN_SRC C
  #include <stdio.h>
  int main(void) {
    printf("Hello World!\n");
    return 0;
  }
#+END_SRC
Je peux annuler tout ça via ces commandes :
#+BEGIN_SRC text
  $ git reset HEAD main.c
  Unstaged changes after reset:
  M       main.c
  $ git checkout -- main.c
  $ git status
  On branch master
  nothing to commit, working tree clean
#+END_SRC
Si je fait un =cat= du fichier, je vois qu’il est revenu à son état initial.
** En fait, j’ai juste oublié un truc dans mon commit précédent
Si jamais tu veux à la place ajouter la modification d’un fichier au dernier commit (mettons, tu as oublié d’ajouter également un fichier texte), tu peux utiliser l’option =--amend= lors du commit du fichier oublié.
#+BEGIN_SRC text
  $ git add main.c # J’ai refait les modifications annulées plus tôt
  $ git commit -m "second commit"
  [master 97f698a] second commit
   1 file changed, 1 insertion(+), 1 deletion(-)
  $ echo "C’est un super projet !" > projet.txt
  $ git add projet.txt
  $ git commit --amend -m "second commit + oubli"
  [master 9aff4c0] second commit + oubli
   Date: Fri Oct 5 11:10:56 2018 +0200
   2 files changed, 2 insertions(+), 1 deletion(-)
   create mode 100644 projet.txt
#+END_SRC
En gros, le commit que tu viens de faire a remplacé le précédent en conservant les informations du commit précédent, mis à part son commentaire. Si tu ne met pas l’option =-m "ton texte"= lors de l’amendement du commit, ton éditeur texte par défaut va s’ouvrir pour que tu puisses modifier le texte du commit précédent si tu le souhaite. Si jamais vi ou vim s’ouvre et que tu n’as aucune idée de comment sortir de cet enfant du démon, tu as juste à appuyer sur la touche Échap (au cas où), puis à taper =:wq= (=w= pour écrire le fichier, =q= pour quitter), puis tu appuye sur la touche Entrée. Si tu as Nano qui s’est ouvert, alors il faut taper Ctrl-X.
