tutoriel-git.html
<div id="outline-container-orgaf9966d" class="outline-3">
<h3 id="orgaf9966d"><span class="section-number-3">3.2</span> Et pour ajouter des fichiers ?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Maintenant tu peux commencer à travailler sur ton projet. Mais tout d’abord, on va voir ce qu’il se passe si jamais on créé un fichier dans le dépot. Créé un fichier <code>main.c</code> dans lequel tu vas entrer ce code :
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #AF6F55;">#include</span> <span style="color: #e2c6ac;">&lt;</span><span style="color: #7A5343;">stdio.h</span><span style="color: #e2c6ac;">&gt;</span>

<span style="color: #AF6F55;">int</span> <span style="color: #B58C65;">main</span><span style="color: #e2c6ac;">(</span><span style="color: #AF6F55;">int</span> <span style="color: #7A5343;">argc</span>, <span style="color: #AF6F55;">char</span> *<span style="color: #7A5343;">argv</span><span style="color: #8D5039;">[]</span><span style="color: #e2c6ac;">)</span> <span style="color: #e2c6ac;">{</span>
  printf<span style="color: #8D5039;">(</span><span style="color: #7A5343;">"Hello World!\n"</span><span style="color: #8D5039;">)</span>;
  <span style="color: #975D4A; font-weight: bold;">return</span> <span style="color: #8D5039;">0</span>;
<span style="color: #e2c6ac;">}</span>
</pre>
</div>
<p>
En exécutant à nouveau <code>git status</code>, on peut voir la sortie suivante :
</p>
<div class="org-src-container">
<pre class="src src-text">$ git status
On branch master

No commits yet

Untracked files:
  (use "git add &lt;file&gt;..." to include in what will be committed)

        main.c

nothing added to commit but untracked files present (use "git add" to track)
</pre>
</div>
<p>
Tu commences à comprendre un peu le bail ? Git vient de détecter qu’un nouveau fichier a été créé qu’il ne connaissait pas avant. Suivons ses bon conseils et ajoutons le fichier au dépôt.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git add main.c
$ git status
On branch master

No commits yet

Changes to be committed:
  (use "git rm --cached &lt;file&gt;..." to unstage)

        new file:   main.c
</pre>
</div>
<p>
Super, maintenant git va surveiller les changements du fichier, mais attention, il n’a pas encore enregistré son état. Pour l’instant il sait juste que le fichier est là, dans un certain état, mais rien ne garanti encore qu’on pourra retrouver cet état plus tard. On appelle ça le <i>staging</i>. Pour ce faire, il faut créer ce qu’on appelle un commit. En gros, il s’agit d’un enregistrement des modifications apportées à un ou plusieurs fichers (dans leur globalité ou partiellement, on verra ça plus tard), le tout avec un commentaire.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git commit -m "Un petit pas pour moi, un grand pas pour mon projet"
[master (root-commit) 89139ef] Un petit pas pour moi, un grand pas pour mon projet
 1 file changed, 6 insertions(+)
 create mode 100644 main.c
</pre>
</div>
<p>
Parfait ! Certains éléments peuvent être un peu différent chez toi, comme par exemple la référence du commit juste avant le message. Ça, c’est un truc qui est géré automatiquement par git. Et voilà, on a l’état de notre répertoire qui est enregistré et qui sera disponible plus tard. Maintenant, tu sais comment enregistrer des état de ton dépôt via les commits.
</p>
</div>
</div>
<div id="outline-container-org4d067d2" class="outline-3">
<h3 id="org4d067d2"><span class="section-number-3">3.3</span> Cool, mais j’ai accidentellement mis un fichier en staging</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Si jamais tu as un staging que tu veux annuler, tu peux utiliser la commande <code>git reset HEAD nomdetonfichier voiredautresfichiers</code> pour annuler le staging. Une fois le fichier qui n’est plus dans ton staging, tu peux même annuler toutes les modifications que tu as apporté au fichier depuis ton dernier commit avec la commande <code>git checkout -- tonfichier voiredautresfichiers</code>. Par exemple, si j’ai modifié mon <code>main.c</code> en modifiant ainsi les arguments du <code>main()</code> :
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #AF6F55;">#include</span> <span style="color: #e2c6ac;">&lt;</span><span style="color: #7A5343;">stdio.h</span><span style="color: #e2c6ac;">&gt;</span>

<span style="color: #AF6F55;">int</span> <span style="color: #B58C65;">main</span><span style="color: #e2c6ac;">(</span><span style="color: #AF6F55;">void</span><span style="color: #e2c6ac;">)</span> <span style="color: #e2c6ac;">{</span>
  printf<span style="color: #8D5039;">(</span><span style="color: #7A5343;">"Hello World!\n"</span><span style="color: #8D5039;">)</span>;
  <span style="color: #975D4A; font-weight: bold;">return</span> <span style="color: #8D5039;">0</span>;
<span style="color: #e2c6ac;">}</span>
</pre>
</div>
<p>
Je peux annuler tout ça via ces commandes :
</p>
<div class="org-src-container">
<pre class="src src-text">$ git reset HEAD main.c
Unstaged changes after reset:
M       main.c
$ git checkout -- main.c
$ git status
On branch master
nothing to commit, working tree clean
</pre>
</div>
<p>
Si je fait un <code>cat</code> du fichier, je vois qu’il est revenu à son état initial.
</p>
</div>
</div>
<div id="outline-container-orga03d27e" class="outline-3">
<h3 id="orga03d27e"><span class="section-number-3">3.4</span> En fait, j’ai juste oublié un truc dans mon commit précédent</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Si jamais tu veux à la place ajouter la modification d’un fichier au dernier commit (mettons, tu as oublié d’ajouter également un fichier texte), tu peux utiliser l’option <code>--amend</code> lors du commit du fichier oublié.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git add main.c # J&#8217;ai refait les modifications annul&#233;es plus t&#244;t
$ git commit -m "second commit"
[master 97f698a] second commit
 1 file changed, 1 insertion(+), 1 deletion(-)
$ echo "C&#8217;est un super projet !" &gt; projet.txt
$ git add projet.txt
$ git commit --amend -m "second commit + oubli"
[master 9aff4c0] second commit + oubli
 Date: Fri Oct 5 11:10:56 2018 +0200
 2 files changed, 2 insertions(+), 1 deletion(-)
 create mode 100644 projet.txt
</pre>
</div>
<p>
En gros, le commit que tu viens de faire a remplacé le précédent en conservant les informations du commit précédent, mis à part son commentaire. Si tu ne met pas l’option <code>-m "ton texte"</code> lors de l’amendement du commit, ton éditeur texte par défaut va s’ouvrir pour que tu puisses modifier le texte du commit précédent si tu le souhaite. Si jamais vi ou vim s’ouvre et que tu n’as aucune idée de comment sortir de cet enfant du démon, tu as juste à appuyer sur la touche Échap (au cas où), puis à taper <code>:wq</code> (<code>w</code> pour écrire le fichier, <code>q</code> pour quitter), puis tu appuye sur la touche Entrée. Si tu as Nano qui s’est ouvert, alors il faut taper Ctrl-X.
</p>
</div>
</div>
</div>
