tutoriel-git.org
** Euh, j’ai oublié ce que j’ai changé lors du dernier commit
Pas de panique ! Tu peux entrer la commande =git diff= afin de voir ce que tout ce que tu as modifié lors de ton dernier commit. Et si tu ne souhaite voir les modifications que d’un certain fichier, tu peux ajouter le nom de ton fichier à la fin de la commande.
#+BEGIN_SRC text
  $ echo "C’est un super projet !" > projet.txt
  $ git diff
  diff --git a/projet.txt b/projet.txt
  index 03b0f20..b93413f 100644
  --- a/projet.txt
  +++ b/projet.txt
  @@ -1 +1 @@
  -projet
  +C’est un super projet !
#+END_SRC
Tu peux également voir les différences de fichiers entre deux commits en entrant leur référence. Pour avoir la référence, tu peux rentrer la commande =git log= pour avoir un petit historique des commits.
#+BEGIN_SRC text
  $ git log
  commit 4380d8717261644b81a1858920406645cf409028 (HEAD -> master)
  Author: Phuntsok Drak-pa <phundrak@phundrak.fr>
  Date:   Fri Oct 5 11:59:40 2018 +0200

      new commit

  commit 59c21c6aa7e3ec7edd229f81b87becbc7ec13596
  Author: Phuntsok Drak-pa <phundrak@phundrak.fr>
  Date:   Fri Oct 5 11:10:56 2018 +0200

      nouveau texte

  commit 89139ef233d07a64d3025de47f8b6e8ce7470318
  Author: Phuntsok Drak-pa <phundrak@phundrak.fr>
  Date:   Fri Oct 5 10:56:58 2018 +0200

      Un petit pas pour moi, un grand pas pour mon projet
#+END_SRC
Bon, c’est un peu long et un peu trop d’infos d’un coup, généralement je préfère taper =git log --oneline --graph --decorate= afin d’avoir un affichage comme suit :
#+BEGIN_SRC text
  $ git log --oneline --graph --decorate
  ,* 4380d87 (HEAD -> master) new commit
  ,* 59c21c6 nouveau texte
  ,* 89139ef Un petit pas pour moi, un grand pas pour mon projet
#+END_SRC
Plus propre, non ? Et les références sont plus courtes, ce qui est plus agréable à taper. Allez, comparons les deux derniers commits.
#+BEGIN_SRC text
  $ git add .
  $ git commit -m "new commit"
  $ git log --oneline --graph --decorate
  ,* 4380d87 (HEAD -> master) new commit
  ,* 59c21c6 nouveau texte
  ,* 89139ef Un petit pas pour moi, un grand pas pour mon projet
  $ git diff 59c21c6 4380d87
  diff --git a/projet.txt b/projet.txt
  index 03b0f20..b93413f 100644
  --- a/projet.txt
  +++ b/projet.txt
  @@ -1 +1 @@
  -projet
  +C’est un super projet !
#+END_SRC
** Il y a des fichiers dont je me fiche dans mon dépôt
Dans ce cas, il est grand temps de te présenter le fichier =.gitignore=. Comme son nom l’indique, il permet au dépôt d’ignorer des fichiers selon ce que tu lui indiqueras. Par exemple, si tu veux ignorer tous les fichiers qui se terminent en =.out= (ou =.exe= sous Windows), tu peux éditer (ou créer) ton =.gitignore= et entrer ces lignes :
#+BEGIN_SRC text
  ,*.out
  ,*.exe
#+END_SRC
Maintenant, si tu créés un fichier en =.out= ou =.exe=, il sera complètement ignoré par git et ne sera pas stocké dans l’historique des versions.
** On est plusieurs dessus en fait…

* J’ai entendu parler de GitHub…
Tu commences à me plaire Enzo ! GitHub est un site web sur lequel tu peux héberger des projets libres ou open-source (si tu ne connais pas la différence, voici [[https://www.gnu.org/philosophy/open-source-misses-the-point.fr.html][un article]] pour t’aider à comprendre, et [[https://www.gnu.org/philosophy/free-software-for-freedom.fr.html][un autre]] pour la route). C’est en particulier orienté pour les projets gérés par git, ce qui tombe bien car c’est ce qu’on utilise. Cela a pour avantage de pouvoir aisément partager ton code et d’assurer qu’il est bien sauvegardé quelque part d’autre que ton disque dur (un =rm -rf= est si vite arrivé). Et surtout, ça peut te permettre de collaborer avec d’autres personnes sur le même projet sans te casser la tête.
** J’ai téléchargé un projet en zip
Ou bien, tu peux télécharger le projet directement via =git=. Eh oui ! git permet de gérer les dépôts dits distants, c’est à dire ceux qui sont hébergés sur un serveur en ligne, comme par exemple sur GitHub. Pour cela, il te faut te munir du lien vers le dépôt git, et le passer en argument de =git clone=. Par exemple, si tu veux télécharger de dépôt du petit logiciel de chat en réseau que j’ai codé durant ma L2 d’informatique, tu peux exécuter ceci :
#+BEGIN_SRC text
  $  git clone https://github.com/Phundrak/chat-reseau-P8.git
  Cloning into 'chat-reseau-P8'...
  remote: Enumerating objects: 345, done.
  remote: Total 345 (delta 0), reused 0 (delta 0), pack-reused 345
  Receiving objects: 100% (345/345), 63.91 KiB | 39.00 KiB/s, done.
  Resolving deltas: 100% (107/107), done.
#+END_SRC
Et c’est bon, tu as accès au répertoire =chat-reseau-P8= et au code source du projet.
** Et si je veux créer mon propre dépôt sur GitHub
Dans ce cas là, c’est simple Brigitte. Il faut que tu te créés un compte sur GitHub, puis tu cliques sur le bouton =+= et =New Repository=. Tu lui donnes le nom que tu souhaites (en l’occurrence je le nomme =temporary-repo= car je vais le supprimer cinq minutes après l’écriture de ces lignes), et tu cliques sur =Create Repository=. Tu n’ajoutes rien avant, pas de description, pas de =.gitignore=, RIEN.

Et là, magie ! GitHub indique comment ajouter le dépôt distant à ton dépôt local.
#+BEGIN_SRC text
  $ git remote add origin https://github.com/Phundrak/temporary-repo.git
#+END_SRC
Et voilà, ton dépôt est lié au dépôt distant. Oui, juste comme ça.
** Et du coup, comment je met tout ça en ligne ?
Bon ok, ce n’est pas aussi simple que ça. Une fois que tu as lié ton dépôt au dépôt distant, il faudra que tu mettes en ligne tes commits quand tu en auras l’occasion. Pour ce faire, tu n’as qu’à taper =git push= ; et la première fois, il faudra que tu indiques à ton dépôt où mettre en ligne précisément dans le dépôt distant, auquel cas tu ajoutes =-u origin master= pour cette première fois. Git te demandera donc tes identifiants GitHub pour pouvoir mettre tout ça en ligne.
#+BEGIN_SRC text
  $ git push -u origin master
  Username for 'https://github.com': phundrak
  Password for 'https://phundrak@github.com':
  Enumerating objects: 10, done.
  Counting objects: 100% (10/10), done.
  Delta compression using up to 8 threads
  Compressing objects: 100% (7/7), done.
  Writing objects: 100% (10/10), 940 bytes | 313.00 KiB/s, done.
  Total 10 (delta 0), reused 0 (delta 0)
  remote:
  remote: Create a pull request for 'master' on GitHub by visiting:
  remote:      https://github.com/Phundrak/temporary-repo/pull/new/master
  remote:
  To https://github.com/Phundrak/temporary-repo.git
   ,* [new branch]      master -> master
  Branch 'master' set up to track remote branch 'master' from 'origin'.
#+END_SRC
Bon, là en nom d’utilisateur y’a le mien, faudra remplacer avec le tiens. Et ouais, ma vitesse de mise en ligne n’est pas fameuse, je suis sur une connexion 3G+ à l’heure où j’écris ces lignes, ne me juge pas. Bref, toujours est-il que je viens de mettre en ligne les fichiers du dépôt sur GitHub. Pas la peine de chercher le mien sur GitHub par contre, ça fera un bail que je l’aurai supprimé au moment où tu liras ces lignes.
