tutoriel-git.html
<div id="outline-container-org5c917f7" class="outline-2">
<h2 id="org5c917f7"><span class="section-number-2">4</span> Euh, j’ai oublié ce que j’ai changé lors du dernier commit</h2>
<div class="outline-text-2" id="text-4">
<p>
Pas de panique ! Tu peux entrer la commande <code>git diff</code> afin de voir ce que tout ce que tu as modifié lors de ton dernier commit. Et si tu ne souhaite voir les modifications que d’un certain fichier, tu peux ajouter le nom de ton fichier à la fin de la commande.
</p>
<div class="org-src-container">
<pre class="src src-text">$ echo "C&#8217;est un super projet !" &gt; projet.txt
$ git diff
diff --git a/projet.txt b/projet.txt
index 03b0f20..b93413f 100644
--- a/projet.txt
+++ b/projet.txt
@@ -1 +1 @@
-projet
+C&#8217;est un super projet !
</pre>
</div>
<p>
Tu peux également voir les différences de fichiers entre deux commits en entrant leur référence. Pour avoir la référence, tu peux rentrer la commande <code>git log</code> pour avoir un petit historique des commits.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git log
commit 4380d8717261644b81a1858920406645cf409028 (HEAD -&gt; master)
Author: Phuntsok Drak-pa <a href="mailto:phundrak%40phundrak.fr">&lt;phundrak@phundrak.fr&gt;</a>
Date:   Fri Oct 5 11:59:40 2018 +0200

    new commit

commit 59c21c6aa7e3ec7edd229f81b87becbc7ec13596
Author: Phuntsok Drak-pa <a href="mailto:phundrak%40phundrak.fr">&lt;phundrak@phundrak.fr&gt;</a>
Date:   Fri Oct 5 11:10:56 2018 +0200

    nouveau texte

commit 89139ef233d07a64d3025de47f8b6e8ce7470318
Author: Phuntsok Drak-pa <a href="mailto:phundrak%40phundrak.fr">&lt;phundrak@phundrak.fr&gt;</a>
Date:   Fri Oct 5 10:56:58 2018 +0200

    Un petit pas pour moi, un grand pas pour mon projet
</pre>
</div>
<p>
Bon, c’est un peu long et un peu trop d’infos d’un coup, généralement je préfère taper <code>git log --oneline --graph --decorate</code> afin d’avoir un affichage comme suit :
</p>
<div class="org-src-container">
<pre class="src src-text">$ git log --oneline --graph --decorate
* 4380d87 (HEAD -&gt; master) new commit
* 59c21c6 nouveau texte
* 89139ef Un petit pas pour moi, un grand pas pour mon projet
</pre>
</div>
<p>
Plus propre, non ? Et les références sont plus courtes, ce qui est plus agréable à taper. Allez, comparons les deux derniers commits.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git add .
$ git commit -m "new commit"
$ git log --oneline --graph --decorate
* 4380d87 (HEAD -&gt; master) new commit
* 59c21c6 nouveau texte
* 89139ef Un petit pas pour moi, un grand pas pour mon projet
$ git diff 59c21c6 4380d87
diff --git a/projet.txt b/projet.txt
index 03b0f20..b93413f 100644
--- a/projet.txt
+++ b/projet.txt
@@ -1 +1 @@
-projet
+C&#8217;est un super projet !
</pre>
</div>
</div>
</div>

<div id="outline-container-org35ba9ee" class="outline-2">
<h2 id="org35ba9ee"><span class="section-number-2">5</span> Il y a des fichiers dont je me fiche dans mon dépot</h2>
<div class="outline-text-2" id="text-5">
<p>
Dans ce cas, il est grand temps de te présenter le fichier <code>.gitignore</code>. Comme son nom l’indique, il permet au dépôt d’ignorer des fichiers selon ce que tu lui indiqueras. Par exemple, si tu veux ignorer tous les fichiers qui se terminent en <code>.out</code> (ou <code>.exe</code> sous Windows), tu peux éditer (ou créer) ton <code>.gitignore</code> et entrer ces lignes :
</p>
<div class="org-src-container">
<pre class="src src-text">*.out
*.exe
</pre>
</div>
<p>
Maintenant, si tu créés un fichier en <code>.out</code> ou <code>.exe</code>, il sera complètement ignoré par git et ne sera pas stocké dans l’historique des versions.
</p>
</div>
</div>

<div id="outline-container-orgccda07e" class="outline-2">
<h2 id="orgccda07e"><span class="section-number-2">6</span> J’ai entendu parler de GitHub…</h2>
<div class="outline-text-2" id="text-6">
<p>
Tu commences à me plaire Enzo ! GitHub est un site web sur lequel tu peux héberger des projets libres ou open-source (si tu ne connais pas la différence, voici <a href="https://www.gnu.org/philosophy/open-source-misses-the-point.fr.html">un article</a> pour t’aider à comprendre, et <a href="https://www.gnu.org/philosophy/free-software-for-freedom.fr.html">un autre</a> pour la route). C’est en particulier orienté pour les projets gérés par git, ce qui tombe bien car c’est ce qu’on utilise. Cela a pour avantage de pouvoir aisément partager ton code et d’assurer qu’il est bien sauvegardé quelque part d’autre que ton disque dur (un <code>rm -rf</code> est si vite arrivé). Et surtout, ça peut te permettre de collaborer avec d’autres personnes sur le même projet sans te casser la tête.
</p>
</div>

<div id="outline-container-orgde64bff" class="outline-3">
<h3 id="orgde64bff"><span class="section-number-3">6.1</span> J’ai téléchargé un projet en zip</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Ou bien, tu peux télécharger le projet directement via <code>git</code>. Eh oui ! git permet de gérer les dépôts dits distants, c’est à dire ceux qui sont hébergés sur un serveur en ligne, comme par exemple sur GitHub. Pour cela, il te faut te munir du lien vers le dépôt git, et le passer en argument de <code>git clone</code>. Par exemple, si tu veux télécharger de dépôt du petit logiciel de chat en réseau que j’ai codé durant ma L2 d’informatique, tu peux exécuter ceci :
</p>
<div class="org-src-container">
<pre class="src src-text">$  git clone https://github.com/Phundrak/chat-reseau-P8.git
Cloning into 'chat-reseau-P8'...
remote: Enumerating objects: 345, done.
remote: Total 345 (delta 0), reused 0 (delta 0), pack-reused 345
Receiving objects: 100% (345/345), 63.91 KiB | 39.00 KiB/s, done.
Resolving deltas: 100% (107/107), done.
</pre>
</div>
<p>
Et c’est bon, tu as accès au répertoire <code>chat-reseau-P8</code> et au code source du projet.
</p>
</div>
</div>

<div id="outline-container-org1e85cba" class="outline-3">
<h3 id="org1e85cba"><span class="section-number-3">6.2</span> Et si je veux créer mon propre dépôt sur GitHub</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Dans ce cas là, c’est simple Kévin. Il faut que tu te créées un compte sur GitHub, puis tu cliques sur le bouton <code>+</code> et <code>New Repository</code>. Tu lui donnes le nom que tu souhaites (en l’occurence je le nomme <code>temporary-repo</code> car je vais le supprimer cinq minutes après l’écriture de ces lignes), et tu cliques sur <code>Create Repository</code>. Tu n’ajoutes rien avant, pas de description, pas de <code>.gitignore</code>, RIEN.
</p>

<p>
Et là, magie ! GitHub indique comment ajouter le dépôt distant à ton dépôt local.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git remote add origin https://github.com/Phundrak/temporary-repo.git
</pre>
</div>
<p>
Et voilà, ton dépôt est lié au dépôt distant. Oui, juste comme ça.
</p>
</div>
</div>

<div id="outline-container-org7eaca37" class="outline-3">
<h3 id="org7eaca37"><span class="section-number-3">6.3</span> Et du coup, comment je met tout ça en ligne ?</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Bon ok, ce n’est pas aussi simple que ça. Une fois que tu as lié ton dépôt au dépôt distant, il faudra que tu mettes en ligne tes commits quand tu en auras l’occasion. Pour ce faire, tu n’as qu’à taper <code>git push</code> ; et la première fois, il faudra que tu indiques à ton dépôt où mettre en ligen précisément dans le dépôt distant, auquel cas tu ajoutes <code>-u origin master</code> pour cette première fois. Git te demandera donc tes identifiants GitHub pour pouvoir mettre tout ça en ligne.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git push -u origin master
Username for 'https://github.com': phundrak
Password for 'https://phundrak@github.com':
Enumerating objects: 10, done.
Counting objects: 100% (10/10), done.
Delta compression using up to 8 threads
Compressing objects: 100% (7/7), done.
Writing objects: 100% (10/10), 940 bytes | 313.00 KiB/s, done.
Total 10 (delta 0), reused 0 (delta 0)
remote:
remote: Create a pull request for 'master' on GitHub by visiting:
remote:      https://github.com/Phundrak/temporary-repo/pull/new/master
remote:
To https://github.com/Phundrak/temporary-repo.git
 * [new branch]      master -&gt; master
Branch 'master' set up to track remote branch 'master' from 'origin'.
</pre>
</div>
<p>
Bon, là en nom d’utilisateur y’a le mien, faudra remplacer avec le tiens. Et ouais, ma vitesse de mise en ligne n’est pas fameuse, je suis sur une connexion 3G+ à l’heure où j’écris ces lignes, ne me juge pas. Bref, toujours est-il que je viens de mettre en ligne les fichiers du dépôt sur GitHub. Pas la peine de chercher le mien sur GitHub par contre, ça fera un bail que je l’aurai supprimé au moment où tu liras ces lignes.
</p>
</div>
</div>
