tutoriel-git.org
** Quelqu’un a fait des modifications depuis mon dernier commit, je récupère ça comment ?
Pour faire un exemple, je viens de créer un =README.md= sur GitHub directement. Ce type de fichiers est assez standard afin de présenter plus ou moins en détails le dépôt et le projet qui y est lié, et son contenu apparaîtra formatté sur la page du dépôt sur GitHub s’il est au format =.md= (Markdown) ou =.org= (org-mode, le Markdown d’Emacs avec lequel est écrit ce tutoriel). Mais il n’est pas présent dans mon dépôt local, du coup je vais devoir le récupérer. On va donc entrer =git pull=.
#+BEGIN_SRC text
  $ git pull
  remote: Enumerating objects: 4, done.
  remote: Counting objects: 100% (4/4), done.
  remote: Compressing objects: 100% (3/3), done.
  remote: Total 3 (delta 0), reused 0 (delta 0), pack-reused 0
  Unpacking objects: 100% (3/3), done.
  From https://github.com/Phundrak/temporary-repo
     4380d87..8bd4896  master     -> origin/master
  Updating 4380d87..8bd4896
  Fast-forward
   README.md | 2 ++
   1 file changed, 2 insertions(+)
   create mode 100644 README.md
#+END_SRC
** Je suis en train de travailler sur le même fichier que Ginette
Là, c’est un problème qui aurait pu être évité avec l’usage des branches dont je t’avais parlé plus haut, mais visiblement, vous êtes sur la même branche. Pas bien. Dans ce cas-là, met-toi d’accord avec Ginette pour savoir qui fait ses push en premier. Si le choix tombe sur Ginette, ou si elle a imposé sa vision des choses et a fait son push avant toi, GitHub va râler car tu n’es pas à jour. Dans ce cas ne panique pas, si tu n’as pas fait tes commits, lance la commande =git stash= ; ça va sauvegarder tes modifications dans un coin à part et va annuler tes modifications

#  LocalWords:  Jean-Kévin staging Ctrl-X déplace-y-toi push
