tutoriel-git.html

<div id="outline-container-org9c233f0" class="outline-3">
<h3 id="org9c233f0"><span class="section-number-3">6.4</span> Quelqu’un a fait des modifications depuis mon dernier commit, je récupère ça comment ?</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Pour faire un exemple, je viens de créer un <code>README.md</code> sur GitHub directement. Ce type de fichiers est assez standard afin de présenter plus ou moins en détails le dépôt et le projet qui y est lié, et son contenu apparaitra formatté sur la page du dépôt sur GitHub s’il est au format <code>.md</code> (Markdown) ou <code>.org</code> (org-mode, le Markdown d’Emacs avec lequel est écrit ce tutoriel). Mais il n’est pas présent dans mon dépôt local, du coup je vais devoir le récupérer. On va donc entrer <code>git pull</code>.
</p>
<div class="org-src-container">
<pre class="src src-text">$ git pull
remote: Enumerating objects: 4, done.
remote: Counting objects: 100% (4/4), done.
remote: Compressing objects: 100% (3/3), done.
remote: Total 3 (delta 0), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (3/3), done.
From https://github.com/Phundrak/temporary-repo
   4380d87..8bd4896  master     -&gt; origin/master
Updating 4380d87..8bd4896
Fast-forward
 README.md | 2 ++
 1 file changed, 2 insertions(+)
 create mode 100644 README.md
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Lucien Cartier-Tilet</p>
<p class="date">Created: 2018-10-05 ven. 13:59</p>
<p class="validation"></p>
</div>
</body>
</html>
